- Apply ()
- Datetimes
- Groupby ()
- Agg()

In [39]:
import pandas as pd

df = pd.read_csv("./data/french-ambs.csv")
df.head()

   id                name    place  year    lat   long      lat_long
0   0  Richer, Christophe  Denmark  1543  55.68  12.57  55.68, 12.57
1   1  Richer, Christophe  Denmark  1541  55.68  12.57  55.68, 12.57
2   2  Danzay, Charles de  Denmark  1561  55.68  12.57  55.68, 12.57
3   3  Danzay, Charles de  Denmark  1563  55.68  12.57  55.68, 12.57
4   4  Danzay, Charles de  Denmark  1582  55.68  12.57  55.68, 12.57

In [40]:
for col in df.columns:
    print(f"{col} is numeric?: {pd.api.types.is_numeric_dtype(df[col])}")

id is numeric?: True
name is numeric?: False
place is numeric?: False
year is numeric?: True
lat is numeric?: True
long is numeric?: True
lat_long is numeric?: False

In [45]:
from random import choice, seed

seed(41)

def my_function(x):
    print(x)
df["date_start"] = df["year"].apply(lambda x:f"{x}-{choice(range(1,13)):02d}-{choice(range(1,29))}")

df.head()

,id,name,place,year,lat,long,lat_long,date_start
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57",1543-07-11
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57",1541-04-6
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",1561-07-19
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57",1563-12-10
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57",1582-09-9

In [48]:
# drop the column year_start
df.drop(columns=["date_start"])

,id,name,place,year,lat,long,lat_long
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57"
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57"
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57"
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57"
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57"
...,...,...,...,...,...,...,...
864,864,"Canossa, Louis de",Venice,1526,45.44,12.33,"45.44, 12.33"
865,865,"Vigier, Jacques",Swiss Cantons,1597,46.94,7.45,"46.94, 7.45"
866,866,"De Selve, Georges",Venice,1537,45.44,12.33,"45.44, 12.33"
867,867,"Noailles, François de, Bishop of Dax",Venice,1559,45.44,12.33,"45.44, 12.33"
868,868,"Calvimont, Jean de",Holy Roman Empire,1525,48.21,16.36,"48.21, 16.36"

In [52]:
# making the year_start better by using a named function
import numpy as np
def get_year_start(row):
    rows = df.loc[
        (df["name"]==row["name"])&
        (df["place"]==row["place"])&
        (df["year"]==row["year"]-1)
    ]
    if len(rows) > 0:
        return np.nan
    date_string = f"{row["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29))}"
    return date_string

df["date_start"]= df.apply(get_year_start, axis=1) # on a df, must pass axis
df.head()

,id,name,place,year,lat,long,lat_long,date_start
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57",NaN
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57",1541-03-5
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",NaN
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57",NaN
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57",NaN